Тест_ЗУП_31_КОРП/src/Catalogs/ТарифыПлатежныхАгентов/ТарифыПлатежныхАгентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифыПлатежныхАгентов</name>
  <attributes>
    <name>ИспользуетсяШкала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаСуммы</name>
    <comment>Способ ввода суммы по тарифу. 0 — процент взимается с полной суммы перевода, 1 — процент взимается с суммы перевода, превышающей предыдущий порог</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Шкала</name>
    <attributes>
      <name>Порог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ТарифыПлатежныхАгентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БлокФункцийПервоначальногоЗаполненияИОбновленияИБ

Процедура СоздатьТарифыПоНастройкам(НастройкиРасчетаЗарплаты = Неопределено) Экспорт
	
	Если НастройкиРасчетаЗарплаты = Неопределено Тогда
		НастройкиРасчетаЗарплаты = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
	КонецЕсли;
	
	// Исполнительные документы
	Если Не НастройкиРасчетаЗарплаты.ИспользоватьИсполнительныеЛисты Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ТарифыПлатежныхАгентов КАК ТарифыПлатежныхАгентов";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Почта России
	Тариф = Справочники.ТарифыПлатежныхАгентов.СоздатьЭлемент();
	Тариф.Наименование = НСтр("ru = 'Почта России'");
	
	Тариф.ИспользуетсяШкала = Истина;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 1000;
	СтрокаШкалы.Сумма = 40;
	СтрокаШкалы.Процент = 5;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 5000;
	СтрокаШкалы.Сумма = 50;
	СтрокаШкалы.Процент = 4;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 20000;
	СтрокаШкалы.Сумма = 150;
	СтрокаШкалы.Процент = 2;
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Порог = 500000;
	СтрокаШкалы.Сумма = 250;
	СтрокаШкалы.Процент = 1.5;
	
	Тариф.Записать();
	
	// Сбербанк РФ
	Тариф = Справочники.ТарифыПлатежныхАгентов.СоздатьЭлемент();
	Тариф.Наименование = НСтр("ru = 'Сбербанк'");
	
	СтрокаШкалы = Тариф.Шкала.Добавить();
	СтрокаШкалы.Процент = 1.75;
	СтрокаШкалы.МинимальнаяСумма = 50;
	СтрокаШкалы.МаксимальнаяСумма = 2000;
	
	Тариф.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
